// © Copyright 2012-2013, 2015-2016 HP Development Company, L.P.

// Task name & description
HSDTaskName = "Proxyserverinställningar";
HSDTaskDescription = "Skrivaren stöder anslutning till internet. Om du använder en proxyserver för att ansluta till internet ska du konfigurera inställningarna nedan.";
TaskDescriptionInAssistantMode = "Para conectar a Servicios Web HP, la impresora se deberá conectar a Internet. Si utiliza un servidor proxy para conectarse a Internet, introduzca la configuración siguiente.\n\nSi no conoce su configuración proxy, consulte la configuración en el panel de preferencias de red o contacte con el administrador del sistema.";

// Radio buttons matrix
HSDProxyServerNotRequiredTitle = "Ingen proxyserver krävs för anslutning till internet";
HSDAutomaticProxySettingsTitle = "Automatiskt (enheten känner av inställningarna automatiskt)";
HSDCustomProxySettingsTitle = "Anpassad proxyserverkonfiguration:";
HSDSystemProxySettingsTitle = "Kopiera systeminställningar";

// Proxy server settings
HSDProxyServerTitle = "Proxyserver:";
ProxyPortTitle = "Proxyport:";

// Authentication
HSDRequiresAuthenticationButton = "Proxyservern kräver autentisering";
HSDUserNameTitle = "Användarnamn:";
HSDPasswordTitle = "Lösenord:";

HSDApplyNowButtonTitle = "Verkställ nu";

// progress titles
UpdateInformationProcessTitle = "Uppdaterar information...";

// alerts
EmptyProxyServerOrPortErrorText = "Både proxyserver och proxyport måste anges.";

EmptyUserNameOrPasswordErrorText = "För autentisering av proxyservern måste både användarnamn och lösenord anges.";

IncorrectProxyServerNameFormatErrorText = "Det gick inte att ställa in namnet på proxyservern. Kontrollera om formatet är giltigt.";

HSDUserNameTooLargeErrorText = "Användarnamnet är för långt. Enheten stödjer användarnamn på upp till %d tecken.";
